DataProcessors/абс_ЗаполнитьСертификаты/абс_ЗаполнитьСертификаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_ЗаполнитьСертификаты</name>
</mdclass:DataProcessor>

InformationRegisters/абс_ТоварыСертификатов/абс_ТоварыСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ТоварыСертификатов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСертификата</name>
    <type>
      <types>EnumRef.абс_ВидыСертификатовНаТовары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/абс_СертификатНаТовары/абс_СертификатНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СертификатНаТовары</name>
  <registerRecords>InformationRegister.абс_ТоварыСертификатов</registerRecords>
  <attributes>
    <name>ДатаНачалаДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Неактуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганСертификации</name>
    <type>
      <types>CatalogRef.абс_ОрганыСертификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСертификата</name>
    <type>
      <types>EnumRef.абс_ВидыСертификатовНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСертификата</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказательЭффективности</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ДатазаписиВБазу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураСертификата</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DataProcessors/абс_ЗаполнитьСертификаты/ObjectModule.bsl
Процедура Инициализировать(Объект, ИмяТабличнойЧасти, ТабличноеПоле) Экспорт
	
	Если ИмяТабличнойЧасти <> "Товары" Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Если НЕ ТабличноеПоле = Неопределено Тогда
		РежимВопроса = РежимДиалогаВопрос.ДаНет;
		ТекстВопроса = "Сертификаты, введные вручную будут заменены автоматически. Продолжить?";
		Ответ = Вопрос(ТекстВопроса, РежимВопроса, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕСли;
	КонецЕсли;
	#КонецЕсли
	
	Обработки.абс_ЗаполнитьСертификаты.ЗаполнитьСертификаты(Объект);
	
КонецПроцедуры

Функция ЗаполнитьСертификатНаПартию(Строка)
	
	Если Не ЗначениеЗаполнено(Строка.СерияНоменклатуры) Тогда
		Сообщить("в строку " + Строка.НомерСтроки + " не подобран сертификат на партию");		
		Возврат Документы.абс_СертификатНаТовары.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ТоварыСертификатов.Регистратор
	|ИЗ
	|	РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатов
	|ГДЕ
	|	абс_ТоварыСертификатов.Номенклатура = &Номенклатура
	|	И абс_ТоварыСертификатов.ДатаНачалаДействияСертификата >= &ДатаПроизводства
	|	И абс_ТоварыСертификатов.ДатаОкончанияДействияСертификата <= &ДатаПроизводства
	|
	|УПОРЯДОЧИТЬ ПО
	|	абс_ТоварыСертификатов.Период УБЫВ";

	Запрос.УстановитьПараметр("ДатаПроизводства", Строка.СерияНоменклатуры.абс_ДатаПроизводства);
	Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Регистратор;
	Иначе
		Сообщить("в строку " + Строка.НомерСтроки + " не подобран сертификат на партию");
		Возврат Документы.абс_СертификатНаТовары.ПустаяСсылка();
	КонецЕсли;

КонецФункции

Функция ЗаполнитьСертификатНаОтгрузку(Строка, ДатаОтгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ТоварыСертификатов.Регистратор       
	|ИЗ
	|	РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатов
	|ГДЕ
	|	абс_ТоварыСертификатов.Номенклатура = &Номенклатура
	|	И абс_ТоварыСертификатов.ДатаНачалаДействияСертификата >= &ДатаОтгрузки
	|	И абс_ТоварыСертификатов.ДатаОкончанияДействияСертификата <= &ДатаОтгрузки
	|
	|УПОРЯДОЧИТЬ ПО
	|	абс_ТоварыСертификатов.Период УБЫВ";

	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Регистратор;
	Иначе
		Сообщить("в строку " + Строка.НомерСтроки + " не подобран сертификат на отгрузку");
		Возврат Документы.абс_СертификатНаТовары.ПустаяСсылка();
	КонецЕсли;

КонецФункции
